# Data Preprocessing

This notebook contains data preprocessing steps, including exploration, data cleaning, and feature generation.

Input: Kaggle World Cities Dataset, loaded from data/raw/worldcitiespop.csv

Output: Preprocessed Dataset, saved into data/processed/world_cities_processed.csv

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from pathlib import Path

DATA_RAW = Path("../data/raw/worldcitiespop.csv")
DATA_PROC = Path("../data/processed")
DATA_PROC.mkdir(parents=True, exist_ok=True)

In [4]:
df = pd.read_csv(DATA_RAW)

C:\Users\Alex\AppData\Local\Temp\ipykernel_31016\3183141574.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv(DATA_RAW)

## Exploration

In [5]:
print("Initial Data Shape:", df.shape)
df.head()

Initial Data Shape: (3173958, 7)

  Country        City  AccentCity Region  Population   Latitude  Longitude
0      ad       aixas       Aixàs    6.0         NaN  42.483333   1.466667
1      ad  aixirivali  Aixirivali    6.0         NaN  42.466667   1.500000
2      ad  aixirivall  Aixirivall    6.0         NaN  42.466667   1.500000
3      ad   aixirvall   Aixirvall    6.0         NaN  42.466667   1.500000
4      ad    aixovall    Aixovall    6.0         NaN  42.466667   1.483333

In [6]:
df.describe()

         Population      Latitude     Longitude
count  4.798000e+04  3.173958e+06  3.173958e+06
mean   4.771957e+04  2.718817e+01  3.708886e+01
std    3.028887e+05  2.195262e+01  6.322302e+01
min    7.000000e+00 -5.493333e+01 -1.799833e+02
25%    3.732000e+03  1.163333e+01  7.303176e+00
50%    1.077900e+04  3.249722e+01  3.528000e+01
75%    2.799050e+04  4.371667e+01  9.570354e+01
max    3.148050e+07  8.248333e+01  1.800000e+02

In [8]:
df.describe(include='all')

,Country,City,AccentCity,Region,Population,Latitude,Longitude
count,3173958,3173952,3173954,3173950.0,4.798000e+04,3.173958e+06,3.173958e+06
unique,234,2351891,2375759,490.0,NaN,NaN,NaN
top,cn,san jose,San Antonio,7.0,NaN,NaN,NaN
freq,238985,328,317,93917.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,4.771957e+04,2.718817e+01,3.708886e+01
std,NaN,NaN,NaN,NaN,3.028887e+05,2.195262e+01,6.322302e+01
min,NaN,NaN,NaN,NaN,7.000000e+00,-5.493333e+01,-1.799833e+02
25%,NaN,NaN,NaN,NaN,3.732000e+03,1.163333e+01,7.303176e+00
50%,NaN,NaN,NaN,NaN,1.077900e+04,3.249722e+01,3.528000e+01
75%,NaN,NaN,NaN,NaN,2.799050e+04,4.371667e+01,9.570354e+01
max,NaN,NaN,NaN,NaN,3.148050e+07,8.248333e+01,1.800000e+02

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3173958 entries, 0 to 3173957
Data columns (total 7 columns):
 #   Column       Dtype
---  ------       -----
 0   country      object
 1   city         object
 2   accent_city  object
 3   region       object
 4   population   float64
 5   lat          float64
 6   lon          float64
dtypes: float64(3), object(4)
memory usage: 169.5+ MB

In [10]:
df.isna().sum()

Country             0
City                6
AccentCity          4
Region              8
Population    3125978
Latitude            0
Longitude           0
dtype: int64

We can see that the data contains duplicates and NaN values

## Preprocessing

In [11]:
df = df.rename(columns={
    'Country': 'country',
    'City': 'city',
    'AccentCity': 'accent_city',
    'Region': 'region',
    'Latitude': 'lat',
    'Longitude': 'lon',
    'Population': 'population'
})

In [13]:
# Drop NaN values in critical columns
df = df.dropna(subset=['city', 'accent_city', 'lat', 'lon'])

# lowercase country and city names
df['country'] = df['country'].str.strip().str.lower()
df['city'] = df['city'].str.strip().str.lower()

In [14]:
# Drop Duplicates keeping the entry with the highest population
df = df.sort_values('population', ascending=False)
df = df.drop_duplicates(subset=['country', 'city'], keep='first')

In [15]:
df.shape

(2611430, 7)

In [16]:
df.head()

,country,city,accent_city,region,population,lat,lon
1544449,jp,tokyo,Tokyo,40,31480498.0,35.685000,139.751389
570824,cn,shanghai,Shanghai,23,14608512.0,31.045556,121.399722
1327914,in,bombay,Bombay,16.0,12692717.0,18.975000,72.825833
2200161,pk,karachi,Karachi,05,11627378.0,24.905600,67.082200
1331162,in,delhi,Delhi,7.0,10928270.0,28.666667,77.216667